# preparation
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# install tools
brew "asdf"
brew "bat"
brew "cmake"
brew "direnv"
brew "ghq"
brew "gitui"
brew "gnu-sed"
brew "go"
brew "imagemagick"
brew "neovim"
brew "nkf"
brew "peco"
brew "rust"
brew "ssh-copy-id"
brew "starship"
brew "tmux"
brew "tree"
brew "vim"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

if OS.mac?
  brew "mas"

  brew "reattach-to-user-namespace"

  cask "alacritty"
  cask "alfred"
  cask "flux"
  cask "google-chrome"
  cask "google-japanese-ime"
  cask "karabiner-elements"
  cask "slack"
  cask "visual-studio-code"
  cask "xquartz"

  mas "GIPHY CAPTURE", id: 668208984
  mas "Headphoned", id: 1040734333
  mas "MW Archiver", id: 958475217
  mas "PopClip", id: 445189367
  mas "Shotty", id: 1250306151
  mas "Skitch", id: 425955336
  mas "Spark", id: 1176895641
  mas "TweetShot", id: 1227057295

  # requires much time for installation
  mas "Xcode", id: 497799835
end
