# preparation
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# install tools
brew "asdf"
brew "bat"
brew "cmake"
brew "colima"
brew "direnv"
brew "docker"
brew "fzf"
brew "gh"
brew "ghq"
brew "gitui"
brew "gnu-sed"
brew "go"
brew "jq"
brew "lazygit"
brew "mise"
brew "neovim"
brew "nkf"
brew "peco"
brew "rust"
brew "sheldon"
brew "ssh-copy-id"
brew "starship"
brew "tmux"
brew "tree"
brew "vim"
brew "xcode-build-server"
brew "yazi"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

if OS.mac?
  brew "mas"

  brew "reattach-to-user-namespace"

  cask "1password"
  cask "alacritty"
  cask "alfred"
  cask "android-studio"
  cask "discord"
  cask "flux"
  cask "google-chrome"
  cask "google-japanese-ime"
  cask "karabiner-elements"
  cask "mockoon"
  cask "obs"
  cask "scroll-reverser"
  cask "sequel-ace"
  cask "slack"
  cask "visual-studio-code"
  cask "wezterm"

  mas "GIPHY CAPTURE", id: 668208984
  mas "Headphoned", id: 1040734333
  mas "MW Archiver", id: 958475217
  mas "PopClip", id: 445189367
  mas "Shotty", id: 1250306151
  mas "Skitch", id: 425955336
  mas "Spark", id: 1176895641
  mas "TweetShot", id: 1227057295

  # requires much time for installation
  mas "Xcode", id: 497799835
end
