74th.scrollkey
PaulOlteanu.theme-railscasts
Poorchop.theme-darktooth
batisteo.vscode-django
CoenraadS.bracket-pair-colorizer
donjayamanne.jupyter
donjayamanne.python-extension-pack
gerane.Theme-FlatlandMonokai
gerane.Theme-Monokai-Aurora
gerane.Theme-Monokai-Cobalt
gerane.Theme-MonokaiEasyForRetina
gerane.Theme-Monokai-Soft-MD
magicstack.MagicPython
ms-python.python
oderwat.indent-rainbow
PKief.material-icon-theme
VisualStudioExptTeam.vscodeintellicode
vscodevim.vim
wholroyd.jinja
