74th.scrollkey
arcticicestudio.nord-visual-studio-code
batisteo.vscode-django
bierner.markdown-preview-github-styles
chrmarti.regex
cocopon.iceberg-theme
CoenraadS.bracket-pair-colorizer
dunstontc.viml
fantasticfears.semantic-data-model-language
gerane.Theme-FlatlandMonokai
ICS.japanese-proofreading
James-Yu.latex-workshop
kiteco.kite
magicstack.MagicPython
monokai.theme-monokai-pro-vscode
ms-python.python
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-ssh-explorer
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
oderwat.indent-rainbow
PaulOlteanu.theme-railscasts
PKief.material-icon-theme
rebornix.ruby
teabyii.ayu
VisualStudioExptTeam.vscodeintellicode
vscodevim.vim
wholroyd.jinja
yzhang.markdown-all-in-one
