74th.scrollkey
batisteo.vscode-django
bierner.markdown-preview-github-styles
CoenraadS.bracket-pair-colorizer
donjayamanne.jupyter
donjayamanne.python-extension-pack
dunstontc.viml
fantasticfears.semantic-data-model-language
gerane.Theme-FlatlandMonokai
harg.iceberg
magicstack.MagicPython
ms-python.python
oderwat.indent-rainbow
PaulOlteanu.theme-railscasts
PKief.material-icon-theme
torn4dom4n.latex-support
VisualStudioExptTeam.vscodeintellicode
vscodevim.vim
wholroyd.jinja
yzhang.markdown-all-in-one
