74th.scrollkey
arcticicestudio.nord-visual-studio-code
batisteo.vscode-django
bierner.markdown-preview-github-styles
cocopon.iceberg-theme
CoenraadS.bracket-pair-colorizer
dunstontc.viml
fantasticfears.semantic-data-model-language
gerane.Theme-FlatlandMonokai
kiteco.kite
magicstack.MagicPython
monokai.theme-monokai-pro-vscode
ms-pyright.pyright
ms-python.python
oderwat.indent-rainbow
PaulOlteanu.theme-railscasts
PKief.material-icon-theme
teabyii.ayu
VisualStudioExptTeam.vscodeintellicode
vscodevim.vim
wholroyd.jinja
yzhang.markdown-all-in-one
