# 準備
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "anyenv"
brew "bat"
brew "cmake"
brew "emojify"
brew "ghq"
brew "gnu-sed"
brew "go"
brew "hub"
brew "imagemagick"
brew "lua"
brew "maven"
brew "nkf"
brew "peco"
brew "rust"
brew "ssh-copy-id"
brew "tig"
brew "tmux"
brew "tree"
brew "vim", args: ["with-lua"]
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"