# 準備
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# high priority
brew "mas"
mas "1Password 7", id: 1333542190
cask "dropbox"
cask "google-chrome"
cask "google-japanese-ime"
cask "java"

# Homebrew
brew "anyenv"
brew "bat"
brew "cmake"
brew "emojify"
brew "ghq"
brew "gnu-sed"
brew "go"
brew "heroku"
brew "hub"
brew "imagemagick"
brew "maven"
brew "mongodb"
brew "nkf"
brew "peco"
brew "reattach-to-user-namespace"
brew "rust"
brew "ssh-copy-id"
brew "tig"
brew "tmux"
brew "tree"
brew "vim", args: ["with-lua"]
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# brew cask
cask "adobe-creative-cloud"
cask "alacritty"
cask "alfred"
cask "basictex"
cask "caffeine"
cask "editaro"
cask "flux"
cask "google-cloud-sdk"
cask "insomniax"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "kite"
cask "mendeley"
cask "slack"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "xquartz"

# Mac App Store
mas "GIPHY CAPTURE", id: 668208984
mas "Headphoned", id: 1040734333
#mas "iPhoto", id: 408981381
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Memory Clean", id: 451444120
mas "Microsoft Remote Desktop", id: 1295203466
mas "MW Archiver", id: 958475217
#mas "Numbers", id: 409203825
#mas "Pages", id: 409201541
mas "PopClip", id: 445189367
mas "Shotty", id: 1250306151
mas "Skitch", id: 425955336
mas "Spark", id: 1176895641
#mas "The Unarchiver", id: 425424353
mas "TweetShot", id: 1227057295

# 遅いので一番最後
mas "Xcode", id: 497799835